owhinata/stm32f746g-disco/port/camera/camera.c
/*
 * The single safety predicate (#67): 48 MHz (30 fps) only when 30 fps is selected
 * AND the mode is small AND the LTDC is NOT scanning out.  Any missing condition
 * clamps to 24 MHz (15 fps) so the 48 MHz DCMI burst cannot overrun the 16-bit
 * SDRAM that the LTDC reads continuously.  ltdc_scanout_active() is false when the
 * LTDC never came up (no display = no contention), which correctly allows 48 MHz.
 */
static struct cam_pclk_sel effective_ov_pclk(uint8_t res)
{
	struct cam_pclk_sel s = { OV5640_PCLK_24M, 24000000u };

	if (cam_fps_sel == 30u && res_is_small(res) && !ltdc_scanout_active()) {
		s.ov = OV5640_PCLK_48M;
		s.hz = 48000000u;
	}
	return s;
}

/*
 * Re-apply the effective PCLK to the live sensor if it differs from what is
 * actually programmed (cam_sensor_pclk_hz).  Called before arming a stream or a
 * snapshot so the sensor PCLK always matches (fps_sel, res, scanout) even when the
 * scanout state changed since the last set_format -- and it fixes the old #45
 * asymmetry where the snapshot lazy-configure never set PCLK at all.  Caller holds
 * cam_lock with the sensor configured.
 */
static int apply_effective_pclk_locked(void)
{
	struct cam_pclk_sel sel = effective_ov_pclk(mode.res);

	if (sel.hz == cam_sensor_pclk_hz)
		return 0;                         /* already programmed (scanout unchanged) */
	if (OV5640_SetPCLK(&ov5640, sel.ov) != OV5640_OK) {
		cam_sensor_pclk_hz = 0u;          /* desynced: force a re-write next time */
		LOG_ERR("OV5640_SetPCLK failed");
		return CAM_ERR_HAL;
	}
	cam_sensor_pclk_hz = sel.hz;
	mode.pclk_hz       = sel.hz;
	if (mode.hts != 0u && mode.vts != 0u)
		mode.fps_target_x10 = (uint16_t)((uint64_t)sel.hz * 10u /
		                                 ((uint32_t)mode.hts * mode.vts));
	/* SetPCLK writes 0x3036/0x3037 (PLL multiplier / root divider) with no internal
	   delay, so the PLL must re-lock: wait >1 frame before arming (#67, codex). */
	tx_thread_sleep(CAM_SETTLE_MODE_MS);
	return 0;
}

static uint32_t res_to_ov(uint8_t r)
{
	switch (r) {
	case CAM_RES_QQVGA:   return OV5640_R160x120;
	case CAM_RES_480x272: return OV5640_R480x272;
	case CAM_RES_VGA:     return OV5640_R640x480;
	case CAM_RES_WVGA:    return OV5640_R800x480;
	default:              return OV5640_R320x240;   /* QVGA */
	}
}

static uint32_t fmt_to_ov(uint8_t f)
{
	switch (f) {
	case CAM_FMT_YUV422: return OV5640_YUV422;
	case CAM_FMT_Y8:     return OV5640_Y8;
	case CAM_FMT_JPEG:   return OV5640_JPEG;
	default:             return OV5640_RGB565;
	}
}

/* Map the port-neutral format to the pipeline's frame_format (for publish). */
static enum frame_format fmt_to_frame(uint8_t f)
{
	switch (f) {
	case CAM_FMT_YUV422: return FRAME_FMT_YUV422;
	case CAM_FMT_Y8:     return FRAME_FMT_Y8;
	case CAM_FMT_JPEG:   return FRAME_FMT_JPEG;
	default:             return FRAME_FMT_RGB565;
	}
}

/*
 * Switch the live resolution / pixel format and apply the per-mode fps timing.
 * Refused while streaming/preview owns the DCMI (the ring is a live target).
 * On any I/O failure the sensor is marked unconfigured and the mode is reset to
 * the QVGA RGB565 default, so a half-applied sensor/DCMI state never persists --
 * the next capture full-re-inits to a state that matches the descriptor (#45).
 * cam_lock held by the caller.
 */
static int camera_set_format_locked(uint8_t res, uint8_t fmt)
{
	struct camera_mode m;
	int jpeg = (fmt == CAM_FMT_JPEG);
	int rc;

	if (cam_stream_active || cam_ext_sink != NULL)
		return CAM_ERR_BUSY;           /* streaming/preview owns the DCMI/DMA */
	if (!sdram_is_up())
		return CAM_ERR_STATE;
	if (res >= CAM_RES__COUNT || fmt >= CAM_FMT__COUNT)
		return CAM_ERR_PARAM;
	if (jpeg && res > CAM_RES_VGA)
		return CAM_ERR_PARAM;          /* JPEG is snapshot-only, gated <= VGA */

	/* Candidate mode: geometry from res + HTS/VTS from the timing table + the
	   effective PCLK from the fps knob (#67).  Validate capacity before the sensor. */
	struct cam_pclk_sel psel = effective_ov_pclk(res);

	m = (struct camera_mode){ .res = res, .format = fmt,
	    .hts = mode_fps[res].hts, .vts = mode_fps[res].vts,
	    .pclk_hz = psel.hz };
	mode_recompute(&m);
	if (m.frame_bytes > CAM_FRAME_MAX_BYTES)
		return CAM_ERR_PARAM;

	if (!info.powered) {
		rc = camera_probe_locked(NULL);
		if (rc != 0)
			return rc;
	}

	/* A JPEG <-> raster change cannot be applied incrementally: the lib's
	   OV5640_SetPixelFormat SETS the JPEG datapath bits (TIMING_TC_REG21 /
	   SYSREM_RESET02 / CLOCK_ENABLE02) but never clears them, so a raster capture
	   after a JPEG one wedges (no sync -> timeout).  Force a clean sensor re-init:
	   clearing IsInitialized lets OV5640_Init re-run the common table, whose first
	   write is a software reset (SYSTEM_CTROL0=0x82) that restores those bits.
	   Toggle the DCMI JPEGMode to match. */
	if (jpeg != (int)mode.is_jpeg) {
		ov5640.IsInitialized = 0U;
		info.configured = 0;
		if (dcmi_set_jpeg(jpeg) != 0) {
			LOG_ERR("DCMI JPEG re-init failed");
			goto fail;
		}
	}

	if (!info.configured) {
		if (OV5640_Init(&ov5640, OV5640_R320x240, OV5640_RGB565) != OV5640_OK) {
			LOG_ERR("OV5640_Init failed");
			goto fail;
		}
		info.configured = 1;
		cam_sensor_pclk_hz = 0u;   /* Init reprogrammed the PLL to its default (#67) */
		tx_thread_sleep(CAM_SETTLE_INIT_MS);
	}

	if (OV5640_SetResolution(&ov5640, res_to_ov(res)) != OV5640_OK)
		goto fail;
	if (OV5640_SetPixelFormat(&ov5640, fmt_to_ov(fmt)) != OV5640_OK)
		goto fail;
	if (OV5640_SetPCLK(&ov5640, psel.ov) != OV5640_OK)      /* fps knob (#67) */
		goto fail;
	cam_sensor_pclk_hz = psel.hz;   /* sensor now matches the effective selection */

	/* Commit the base mode now: the quality re-apply + timing below needs the
	   committed mode (ZoomConfig reads the new DVPHO/DVPVO, night mode rewrites
	   AEC, and apply_vts writes the effective VTS from mode.hts/vts).  A failure
	   after this lands in the fail path, which resets to the default. */
	mode = m;
	rc = settings_and_timing_apply_locked();   /* SDE settings + HTS/VTS clamp */
	if (rc != 0)
		goto fail;

	info.frame_valid = 0;              /* geometry changed: old frame is stale */
	info.frame_bytes = 0;
	cam_colorbar     = -1;             /* next capture re-establishes live/colorbar */
	tx_thread_sleep(CAM_SETTLE_MODE_MS);
	return 0;

