owhinata/stm32f746g-disco/port/camera/camera.c
	/* Completions observed this pass (one semaphore each): the wake plus any
	   drained extras.  We publish at most the most-recent buffer flip; every
	   other observed completion was overwritten -> ring overrun. */
	while (tx_semaphore_get(&cam_stream_sem, TX_NO_WAIT) == TX_SUCCESS)
		extra++;
	seen = (had_sem ? 1u : 0u) + extra;

	ct = (DMA2_Stream1->CR & DMA_SxCR_CT) ? 1u : 0u;
	if (ct != cam_last_ct) {
		cam_last_ct = ct;
		/* CT==1 -> M0 just completed; CT==0 -> M1 just completed (the HAL
		   HAL_DMA_IRQHandler DBM dispatch mirrors this). */
		done = ct ? cam_m0 : cam_m1;
		freed = frame_pipeline_acquire(&cam_pipe);
		if (freed != NULL) {
			if (ct) {
				(void)HAL_DMAEx_ChangeMemory(&hdma_dcmi,
				        (uint32_t)freed->data, MEMORY0);
				cam_m0 = freed;
			} else {
				(void)HAL_DMAEx_ChangeMemory(&hdma_dcmi,
				        (uint32_t)freed->data, MEMORY1);
				cam_m1 = freed;
			}
			frame_pipeline_publish(&cam_pipe, done, mode.frame_bytes,
			                       fmt_to_frame(mode.format), mode.width,
			                       mode.height,
			                       (uint16_t)(mode.width *
			                                  mode.bytes_per_pixel));
			published = 1;
		}
		/* freed == NULL: no free slot, drop (do not publish); the M-reg keeps
		   pointing at `done`, so the DMA simply refills it next cycle. */
	}
	if (seen > (uint32_t)published)
		cam_ring_ovr += seen - (uint32_t)published;
}

/* ---- JPEG variable-length streaming (issue #63) -------------------------- */
/*
 * JPEG cannot ride the raster DBM/TC path: a JPEG frame is shorter than the DMA
 * budget, so the transfer-complete interrupt never fires at the frame boundary.
 * Instead each frame is a single DCMI SNAPSHOT (CM=1) into one ring slot, and the
 * DCMI FRAME interrupt (the same end-of-frame the snapshot path uses) delimits it.
 * After each frame the DCMI stops capturing on its own, so re-arming into the next
 * slot cannot overrun the FIFO mid-gap (a CM=0 continuous re-point would).  The
 * producer thread owns all of Stop / finalize / publish / re-arm; the ISR only
 * posts cam_stream_sem.  Frames that fall in the Stop..re-arm gap are dropped.
 */

/* Arm one JPEG snapshot DMA into @p slot and enable the FRAME interrupt (the
   variable-length boundary).  Mirrors the snapshot arm sequence; returns the HAL
   status so the caller can treat a failed (re-)arm as terminal. */
static HAL_StatusTypeDef cam_jpeg_arm(struct frame_desc *slot)
{
	HAL_StatusTypeDef st;

	__HAL_DCMI_CLEAR_FLAG(&hdcmi, DCMI_FLAG_ERRRI | DCMI_FLAG_OVRRI |
	                              DCMI_FLAG_FRAMERI | DCMI_FLAG_LINERI |
	                              DCMI_FLAG_VSYNCRI);
	__HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_ERR | DCMI_IT_OVR | DCMI_IT_FRAME);
	st = HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, (uint32_t)slot->data,
	                        CAM_JPEG_BUDGET_WORDS);
	if (st != HAL_OK)
		return st;
	/* The banding path enables the DMA FIFO/direct-mode error interrupts; under
	   SDRAM contention HAL's DCMI_DMAError would abort the capture, so silence the
	   non-fatal FE/DME the way the snapshot path does (#45 R8). */
	__HAL_DMA_DISABLE_IT(&hdma_dcmi, DMA_IT_FE);
	__HAL_DMA_DISABLE_IT(&hdma_dcmi, DMA_IT_DME);
	return HAL_OK;
}

/* Copy the just-finalised JPEG frame into the (idle during streaming) snapshot
   buffer so `camera save` / `camera send` -- which read cam_frame via
   camera_frame_read -- can pull a live or last streamed frame.  Brief cam_lock
   (the teardown pattern) keeps camera_frame_read from seeing a torn frame; called
   AFTER publish so the lock order stays cam_lock -> cam_pipe_lock (never nested). */
static void mirror_to_cam_frame(const struct frame_desc *slot, uint32_t valid)
{
	if (valid > CAM_FRAME_MAX_BYTES)
		return;                          /* cannot happen (budget < cam_frame) */
	(void)tx_mutex_get(&cam_lock, TX_WAIT_FOREVER);
	memcpy(cam_frame, slot->data, valid);
	info.frame_bytes = valid;
	info.frame_valid = 1;
	cam_frame_gen++;
	(void)tx_mutex_put(&cam_lock);
}

/* Stop conditions shared by both stream services. */
static int cam_stream_should_stop(void)
{
	return cam_stop_req || cam_stream_err ||
	       (cam_target_frames && cam_pipe.stats.published >= cam_target_frames) ||
	       (cam_target_secs &&
	        (HAL_GetTick() - cam_start_tick) >= cam_target_secs * 1000u);
}

/* Service one JPEG frame: finalise the current slot (Stop -> NDTR -> EOI trim),
   publish it at its real length, mirror it for save/send, then re-arm into a free
   slot.  Every HAL failure (Stop / re-arm) is terminal -> teardown, so the stream
   never sticks "active" with no frame coming.  Producer-thread only. */
static void cam_stream_service_jpeg(int had_sem)
{
	uint32_t ndtr, eff, valid;
	struct frame_desc *freed;

	/* Stop conditions FIRST (stop/error/target share cam_stream_sem with FRAME). */
	if (cam_stream_should_stop()) {
		cam_stream_teardown();
		return;
	}
	if (!had_sem)
		return;                          /* bounded-timeout wake, no frame yet */

	/* FRAME arrived: the slot is no longer a live DMA target once stopped. */
	if (HAL_DCMI_Stop(&hdcmi) != HAL_OK) {
		cam_stream_err = 1;
		cam_stream_teardown();
		return;
	}
	ndtr = __HAL_DMA_GET_COUNTER(&hdma_dcmi);
	eff  = (CAM_JPEG_BUDGET_WORDS - ndtr) * 4u;
	if (jpeg_trim(cam_jpeg_slot->data, eff, &valid) == 0) {
		freed = frame_pipeline_acquire(&cam_pipe);
		if (freed != NULL) {
			frame_pipeline_publish(&cam_pipe, cam_jpeg_slot, valid,
			                       FRAME_FMT_JPEG, mode.width, mode.height, 0u);
			mirror_to_cam_frame(cam_jpeg_slot, valid);
			cam_jpeg_slot = freed;       /* fill a fresh slot next */
		} else {
			cam_ring_ovr++;              /* no free slot: drop, reuse this slot */
		}
	} else {
		cam_jpeg_trunc++;                /* no SOI/EOI: drop, reuse this slot */
	}

	/* Re-evaluate stop after publishing so a --frames/--secs target does not arm
	   one extra capture. */
	if (cam_stream_should_stop()) {
		cam_stream_teardown();
		return;
	}
	if (cam_jpeg_arm(cam_jpeg_slot) != HAL_OK) {
		cam_stream_err = 1;
		cam_stream_teardown();
	}
}

