owhinata/stm32f746g-disco/port/camera/camera.c
	cam_stream_active = 1;             /* arm the ISR + producer */
	if (HAL_DMAEx_MultiBufferStart_IT(&hdma_dcmi,
	        (uint32_t)&hdcmi.Instance->DR,
	        (uint32_t)cam_m0->data, (uint32_t)cam_m1->data,
	        mode.frame_words) != HAL_OK) {
		cam_stream_active = 0;
		if (ext != NULL)
			frame_pipeline_detach(&cam_pipe, ext);
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		LOG_ERR("stream DMA start failed");
		return CAM_ERR_HAL;
	}
	hdcmi.Instance->CR &= ~DCMI_CR_CM;            /* continuous */
	__HAL_DCMI_ENABLE(&hdcmi);
	__HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_ERR | DCMI_IT_OVR);
	hdcmi.Instance->CR |= DCMI_CR_CAPTURE;
	hdcmi.State = HAL_DCMI_STATE_BUSY;

	cam_ext_sink = ext;               /* record preview ownership (NULL = plain) */

	/* Wake the producer out of its idle FOREVER wait on the dedicated start
	   semaphore -- never the completion semaphore, so it cannot be miscounted. */
	(void)tx_semaphore_put(&cam_start_sem);
	LOG_INF("stream start (frames=%lu secs=%lu%s)",
	        (unsigned long)frames, (unsigned long)secs,
	        ext ? ", gui preview" : "");
	return 0;
}

int camera_stream_start(int colorbar, uint32_t frames, uint32_t secs)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	if (cam_ext_sink != NULL) {        /* owned by the GUIX live preview (#56) */
		op_unlock();
		return CAM_ERR_BUSY;
	}
	rc = stream_start_locked(colorbar, frames, secs, NULL);
	op_unlock();
	return rc;
}

int camera_preview_start(struct frame_sink *s)
{
	int rc;

	if (s == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	/* JPEG has no LCD decode path (#63): reject preview rather than silently
	   switching the user's selected format to RGB565.  `camera format rgb565`
	   first, then `gui camera on`. */
	if (mode.is_jpeg) {
		op_unlock();
		return CAM_ERR_PARAM;
	}
	/* Preview forces QVGA RGB565 (the #56 GUIX sink's only accepted geometry)
	   regardless of the last `camera res/format`.  Same lock: call the locked
	   helper, never the public camera_set_format (which would re-take cam_lock).
	   The set_format gate passes because no stream/preview owns the DCMI yet. */
	rc = camera_set_format_locked(CAM_RES_QVGA, CAM_FMT_RGB565);
	if (rc == 0)
		rc = stream_start_locked(0, 0, 0, s);
	op_unlock();
	return rc;
}

int camera_preview_stop(struct frame_sink *s)
{
	int inflight = 0;

	if (op_lock() != 0)
		return 0;
	if (s != NULL && cam_ext_sink == s) {
		/* Still the owner: unlink (no more new consume) -- detach reports the
		   pins held for s (incl. a frame already pre-pinned by publish() but not
		   yet consumed), so the caller can drain it -- release ownership, then
		   ask the producer to tear the stream down. */
		inflight = frame_pipeline_detach(&cam_pipe, s);
		cam_ext_sink = NULL;
		if (cam_stream_active) {
			cam_stop_req = 1;
			(void)tx_semaphore_put(&cam_stream_sem);
		}
	}
	/* else: an async teardown (OVR) already released ownership -- do nothing, so
	   a delayed `off` cannot stop a different stream started since. */
	op_unlock();
	return inflight;
}

void camera_frame_put(struct frame_sink *s, const struct frame_desc *f)
{
	frame_pipeline_put(&cam_pipe, s, f);
}

int camera_stream_stop(void)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	if (cam_ext_sink != NULL) {        /* owned by the GUIX live preview (#56) */
		op_unlock();
		return CAM_ERR_BUSY;
	}
	if (cam_stream_active) {
		cam_stop_req = 1;
		(void)tx_semaphore_put(&cam_stream_sem);  /* producer tears down */
	}
	op_unlock();
	return 0;
}

int camera_stream_stats(struct camera_stream_info *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	/* active / err / elapsed transition under cam_lock; the DCMI/ring overrun
	   counters are volatile (atomic 32-bit reads). */
	out->active     = cam_stream_active;
	out->err        = cam_stream_err;
	out->dcmi_ovr   = cam_stream_ovr;
	out->ring_ovr   = cam_ring_ovr;
	out->dma_fe     = cam_stream_fe;
	out->jpeg_trunc = cam_jpeg_trunc;
	out->slots      = cam_ring_slots;
	out->slot_bytes = cam_ring_slot_bytes;
	out->elapsed_ms = cam_stream_active ? (HAL_GetTick() - cam_start_tick)
	                                    : cam_elapsed_ms;
	/* Coherent snapshot of the pipeline-owned counters (the producer writes them
	   under cam_pipe_lock).  Lock order is always cam_lock -> cam_pipe_lock
	   (matching start / teardown), so this nesting cannot deadlock. */
	(void)tx_mutex_get(&cam_pipe_lock, TX_WAIT_FOREVER);
	out->frames    = cam_pipe.stats.published;
	out->delivered = cam_stat_sink.delivered;
	out->dropped   = cam_stat_sink.dropped;
	(void)tx_mutex_put(&cam_pipe_lock);
	op_unlock();
	return 0;
}

int camera_init(void)
{
	GPIO_InitTypeDef g = {0};
	OV5640_IO_t io;

	if (cam_ready)
		return 0;

	if (tx_mutex_create(&cam_lock, "camera", TX_INHERIT) != TX_SUCCESS)
		return CAM_ERR_STATE;
	if (tx_semaphore_create(&cam_done, "cam_done", 0) != TX_SUCCESS) {
		tx_mutex_delete(&cam_lock);
		return CAM_ERR_STATE;
	}
	/* Streaming (issue #46): the pipeline's frame_os mutex and the DMA-TC ->
	   producer wakeup semaphore.  The producer thread is created at the end. */
	if (tx_mutex_create(&cam_pipe_lock, "campipe", TX_INHERIT) != TX_SUCCESS) {
		tx_semaphore_delete(&cam_done);
		tx_mutex_delete(&cam_lock);
		return CAM_ERR_STATE;
	}
	if (tx_semaphore_create(&cam_stream_sem, "cam_strm", 0) != TX_SUCCESS) {
		tx_mutex_delete(&cam_pipe_lock);
		tx_semaphore_delete(&cam_done);
		tx_mutex_delete(&cam_lock);
		return CAM_ERR_STATE;
	}
	if (tx_semaphore_create(&cam_start_sem, "cam_strt", 0) != TX_SUCCESS) {
		tx_semaphore_delete(&cam_stream_sem);
		tx_mutex_delete(&cam_pipe_lock);
		tx_semaphore_delete(&cam_done);
		tx_mutex_delete(&cam_lock);
		return CAM_ERR_STATE;
	}

	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	__HAL_RCC_GPIOG_CLK_ENABLE();
	__HAL_RCC_GPIOH_CLK_ENABLE();
	__HAL_RCC_I2C1_CLK_ENABLE();
	__HAL_RCC_DCMI_CLK_ENABLE();
	__HAL_RCC_DMA2_CLK_ENABLE();

	/* PWR_EN: drive the OFF level while the pin is still an input so the
	   output never glitches the module on. */
	HAL_GPIO_WritePin(CAM_PWR_PORT, CAM_PWR_PIN, GPIO_PIN_SET);
	g.Pin   = CAM_PWR_PIN;
	g.Mode  = GPIO_MODE_OUTPUT_PP;
	g.Pull  = GPIO_NOPULL;
	g.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(CAM_PWR_PORT, &g);

	/* I2C1: PB8 = SCL, PB9 = SDA (UM1907 CN2/P1), AF4 open-drain.  The bus
	   has 4.7k pull-ups on the board. */
	g.Pin       = GPIO_PIN_8 | GPIO_PIN_9;
	g.Mode      = GPIO_MODE_AF_OD;
	g.Pull      = GPIO_NOPULL;
	g.Speed     = GPIO_SPEED_FREQ_HIGH;
	g.Alternate = GPIO_AF4_I2C1;
	HAL_GPIO_Init(GPIOB, &g);

	hcam_i2c.Instance              = I2C1;
	hcam_i2c.Init.Timing           = CAM_I2C_TIMING;
	hcam_i2c.Init.OwnAddress1      = 0;
	hcam_i2c.Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
	hcam_i2c.Init.DualAddressMode  = I2C_DUALADDRESS_DISABLE;
	hcam_i2c.Init.OwnAddress2      = 0;
	hcam_i2c.Init.GeneralCallMode  = I2C_GENERALCALL_DISABLE;
	hcam_i2c.Init.NoStretchMode    = I2C_NOSTRETCH_DISABLE;
	if (HAL_I2C_Init(&hcam_i2c) != HAL_OK) {
		LOG_ERR("I2C1 init failed");
		goto fail;
	}

	/* DCMI pins (P1, AF13): PA4=HSYNC, PA6=PIXCLK, PG9=VSYNC, PD3=D5,
	   PE5=D6, PE6=D7, PH9..PH12,PH14=D0..D4.  Pull-up like the ST BSP. */
	g.Mode      = GPIO_MODE_AF_PP;
	g.Pull      = GPIO_PULLUP;
	g.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
	g.Alternate = GPIO_AF13_DCMI;
	g.Pin       = GPIO_PIN_4 | GPIO_PIN_6;
	HAL_GPIO_Init(GPIOA, &g);
	g.Pin       = GPIO_PIN_3;
	HAL_GPIO_Init(GPIOD, &g);
	g.Pin       = GPIO_PIN_5 | GPIO_PIN_6;
	HAL_GPIO_Init(GPIOE, &g);
	g.Pin       = GPIO_PIN_9;
	HAL_GPIO_Init(GPIOG, &g);
	g.Pin       = GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 |
	              GPIO_PIN_14;
	HAL_GPIO_Init(GPIOH, &g);

